offline/OpenFOAM/incompressible/simpleFoam/bump2D/system/ITHACA-FVControls
potentialFlow
{
    nNonOrthogonalCorrectors 10;
}
