offline/OpenFOAM/incompressible/simpleFoam/bump2D/system/ITHACA-FVSolvers
    Usup
    {
        type            coupled;
        solver          PBiCCCG;
        preconditioner  DILU;
        tolerance       (1e-06 1e-06 1e-06);
        relTol          (0 0 0);
    }

    Phi
    {
        $p;
    }
